app/Services/TradeChartService.php

    public static function assetUsdt()
    {
        $assetUsdt= TraderAsset::where("asset_symbol", 'USDT')->groupBy("created_at")
            ->selectRaw('created_at , sum(balance) as balance')
            ->whereBetween('created_at', [Carbon::now()->subDay(), Carbon::now()])
            ->where("type",1)->get();
---
select created_at , sum(balance) as balance from `trader_assets` where `asset_symbol` = 'USDT' and `created_at` between '2021-09-24 12:37:13' and '2021-09-25 12:37:13' and `type` = 1 and `trader_assets`.`deleted_at` is null group by `created_at`

    public static function assetCyce()
    {
        $assetCyce= TraderAsset::where("asset_symbol", 'CYCE')->groupBy("created_at")->selectRaw('created_at , sum(balance) as balance')
            ->whereBetween('created_at', [Carbon::now()->subDay(), Carbon::now()])
            ->where("type",1)->get();
---
select created_at , sum(balance) as balance from `trader_assets` where `asset_symbol` = 'CYCE' and `created_at` between '2021-09-24 12:37:13' and '2021-09-25 12:37:13' and `type` = 1 and `trader_assets`.`deleted_at` is null group by `created_at`