app/Http/Controllers/Api/TokenController.php

select * from `tokens` where `id` = '1' and `tokens`.`deleted_at` is null limit 1
---
    public function show($id)
    {
        //
       $token = Token::whereId($id)->first();