app/Http/Controllers/Api/TransactionController.php

    public function getTransactionForPowerStation($address)
    {
        $transaction = Transaction::where("type", 5)->where("address", $address)->orderBy("period", "asc")->get();
---
select * from `transactions` where `type` = 5 and `address` = 'undefined' and `transactions`.`deleted_at` is null order by `period` asc