app/Http/Controllers/Report/ExchangeReportController.php

select sum(`amount`) as aggregate from `trades` where `inserted_at` >= '15.10.2020' and `trades`.`deleted_at` is null group by `taker_side`
select sum(`amount`) as aggregate from `trades` where `type` = 2 and `inserted_at` >= '15.10.2020' and `trades`.`deleted_at` is null
select taker_side, sum(amount) as totalAmount,sum(taker_fee) as totalFee from `trades` where `inserted_at` >= '2021-10-02' and `inserted_at` <= '2021-10-03' and `trades`.`deleted_at` is null group by `taker_side`
---
    public function index(Request $request)
    {
        $tradeData= Trade::query();
        $tradeData->selectRaw("taker_side, sum(amount) as totalAmount,sum(taker_fee) as totalFee");
        if(isset($request->type) && !is_null($request->type))
        {
            $tradeData->where("type", $request->type);
        }
        if(isset($request->startDate) && !is_null($request->startDate))
        {
            $tradeData->where("inserted_at",  ">=", $request->startDate);
        }
        if(isset($request->finishDate) && !is_null($request->finishDate))
        {
            $tradeData->where("inserted_at",  "<=", $request->finishDate);
        }

        $tradeData->groupBy("taker_side");



        return view("report.exchange-report")
            ->with([
                "tradeData" => $tradeData->get()
            ]);