app/DataTables/PowerStationDataTable.php

    public function dataTable($query)
    {
        $link="";

        $dataTable = new EloquentDataTable($query);
        return $dataTable
            ->addColumn('action', 'power_stations.datatables_actions')
            ->addColumn('test', function ($item) {
                if(auth_user()->isPartner()){
                    $link="transfer-view";
                }else{
                    $link="transfer-list";
                }
                $vallet=Token::select("id")->where("dealer_id", get_user_dealer_id())->first();
---
select `id` from `tokens` where `dealer_id` = 1 and `tokens`.`deleted_at` is null limit 1