app/Http/Controllers/TraderAssetController.php

    public function index(TraderAssetDataTable $traderAssetDataTable)
    {

        $data=TraderAsset::latest()->take(4)->get();
---
select * from `trader_assets` where `trader_assets`.`deleted_at` is null order by `created_at` desc limit 4