app/Http/Controllers/TradeController.php

select `side`, `amount`, `inserted_at`, `taker_side` from `trades` where `side` <> 'SELF_TRADING' and `trades`.`deleted_at` is null
select * from `trader_assets` where `trader_assets`.`deleted_at` is null order by `created_at` desc limit 4
---
    public function index(TradeDataTable $tradeDataTable)
    {
        $totalOutBid=Trade::select("side", "amount", "inserted_at", "taker_side")->where("side", "<>","SELF_TRADING")->get();

        $exchange= Exchange::first();


        $data=TraderAsset::latest()->take(4)->get();