app/Providers/ViewServiceProvider.php

    public function boot()
    {
        View::composer(['trader_assets.fields'], function ($view) {
            $exchangeItems = Exchange::pluck('name','id')->toArray();
            $view->with('exchangeItems', $exchangeItems);
        });
        View::composer(['trader_assets.fields'], function ($view) {
            $exchangeItems = Exchange::pluck('name','id')->toArray();
            $view->with('exchangeItems', $exchangeItems);
        });
        View::composer(['trader_assets.fields'], function ($view) {
            $exchangeItems = Exchange::pluck('name','id')->toArray();
            $view->with('exchangeItems', $exchangeItems);
        });
        View::composer(['power_stations.fields'], function ($view) {
            $partnerItems = Partner::sortByNameDesc()->pluck('name','id')->toArray();
            $view->with('partnerItems', $partnerItems);
        });
        View::composer(['tokens.fields'], function ($view) {
            $dealerItems = Dealer::sortByNameDesc()->pluck('name','id')->toArray();
            $view->with('dealerItems', $dealerItems);
        });
        View::composer(['traders.fields'], function ($view) {
            $exchangeItems = Exchange::pluck('name','id')->toArray();
            $view->with('exchangeItems', $exchangeItems);
        });
        View::composer(['power_stations.fields'], function ($view) {
            $valletItems = Vallet::pluck('name','id')->toArray();
            $view->with('valletItems', $valletItems);
        });
---
select `name`, `id` from `vallets` where not exists (select * from `power_stations` where `vallets`.`id` = `power_stations`.`vallet_id` and `power_stations`.`deleted_at` is null and `partner_id` = 1) and `vallets`.`deleted_at` is null order by `name` asc